return {
  {
    "goolord/alpha-nvim",
    opts = function(_, opts)
      local logo = [[
                                                             
      ██╗      █████╗ ██████╗  █████╗ ██╗   ██╗██╗███╗   ███╗
      ██║     ██╔══██╗██╔══██╗██╔══██╗██║   ██║██║████╗ ████║
      ██║     ███████║██████╔╝███████║██║   ██║██║██╔████╔██║
      ██║     ██╔══██║██╔══██╗██╔══██║╚██╗ ██╔╝██║██║╚██╔╝██║
      ███████╗██║  ██║██║  ██║██║  ██║ ╚████╔╝ ██║██║ ╚═╝ ██║
      ╚══════╝╚═╝  ╚═╝╚═╝  ╚═╝╚═╝  ╚═╝  ╚═══╝  ╚═╝╚═╝     ╚═╝
                                                                   
          🚀 Powered by LazyVim • Crafted for Laravel 🚀      
                                                                   
      ]]
      opts.section.header.val = vim.split(logo, "\n")
      opts.section.header.opts.hl = "LaravimLogo"  -- Usar highlight personalizado
      
      -- Definir el color personalizado
      vim.api.nvim_set_hl(0, "LaravimLogo", { fg = "#FF2D20" })  -- Color rojo de Laravel

      return opts
    end,
  },
}
